import sys
input = sys.stdin.readline

# **인접한 모든 자리의 차이가 1** ⇒ 이런 수를 계단 수라고 한다.
# **N이 주어질 때, 길이가 N인 계단 수가 총 몇 개** 있는지 구해보자.
# ⇒ 0으로 시작하는 수는 계단수 X

# => 길이가 1인 계단수는 1, 2, 3, 4, 5, 6, 7, 8, 9 = > 9개
# => 길이가 2인 계단수는 12, 23, 34, 45, 56, 67, 78, 89 / 10, 21, 32, 43, 54, 65, 76, 87, 98=> 17개
# => 길이가 3인 계단수는
# 101, 121, 123,
# 210, 212, 232, 234,
# 321, 323, 343, 345,
# 432, 434, 454, 456,
# 543, 545, 565, 567,
# 654, 656, 676, 678,
# 765, 767, 787, 789,
# 876, 878, 898, 987, 989 =>  32개
# => 길이가 4인 계단수는
# 1010, 1012, 1210, 1212, 1232, 1234,
# 2101, 2121, 2123, 2321, 2323, 2343, 2345,
# 3210, 3212, 3232, 3234, 3432, 3434, 3454, 3456,
# 4321, 4323, 4343, 4345, 4543, 4545, 4565, 4567, ...


def get_stair_nums(n):
    global dp
    for i in range(1, 10):
        dp[1][i] += 1
    if n == 1:
        return sum(dp[1])
    else:
        dp[2] = [1, 1, 2, 2, 2, 2, 2, 2, 2, 1]
        for j in range(3, n+1):
            dp[j][0] = dp[j-1][1]
            for i in range(1, 9):
                dp[j][i] = dp[j-1][i-1] + dp[j-1][i+1]
            dp[j][9] = dp[j-1][8]
        return sum(dp[n])


N = int(input())
dp = [[0 for i in range(10)] for j in range(N+1)]
print(get_stair_nums(N) % 1000000000)
# print(dp)
